# Parameters
nc: 2  # number of classes
scales:
  n: [0.50, 0.25, 1024]

# YOLOv8-AlexNet Backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, TorchVision, [256, alexnet, "DEFAULT", True, 2, True]]  # 0 - alexnet (truncated)
  - [0, 1, Index, [192, 5]]                                                  # 1 - P3/8  (B, 192, 79, 79)
  - [0, 1, Index, [256, 12]]                                                 # 2 - P4/16 (B, 256, 39, 39)
  - [0, 1, Index, [256, 13]]                                                 # 3 - P5/32 (B, 256, 19, 19)


head:
  - [-1, 1, nn.Identity, []]                                                # Placeholder, not strictly needed

  # --- FPN (Top-Down) Pathway ---
  - [-1, 1, Conv, [128, 1, 1]]          # 4 - P5: Reduce channels (B, 256, 19, 19) -> (B, 128, 19, 19)
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 5 - Upsample P5 to match P4 size (B, 128, 39, 39)
  - [[-1, 2], 1, Concat, [1]]          # 6 - Concatenate upsampled P5 with P4 (B, 128+256, 39, 39) -> (B, 384, 39, 39)
  - [-1, 3, C2f, [128, True]]           # 7 - C2f after P4 concatenation (B, 384, 39, 39) -> (B, 128, 39, 39)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]  # 8 - Upsample to match P3 size (B, 128, 79, 79)
  - [[-1, 1], 1, Concat, [1]]          # 9 - Concatenate upsampled with P3 (B, 128+192, 79, 79) -> (B, 320, 79, 79)
  - [-1, 3, C2f, [64, True]]            # 10 - C2f after P3 concatenation (B, 320, 79, 79) -> (B, 64, 79, 79)

  # --- PANet (Bottom-Up) Pathway ---
  - [-1, 1, Conv, [128, 3, 2]]          # 11 - Downsample P3 (stride=2) (B, 64, 79, 79) -> (B, 128, 39, 39)
  - [[-1, 7], 1, Concat, [1]]          # 12 - Concatenate with P4 (B, 128+128, 39, 39) -> (B, 256, 39, 39)
  - [-1, 3, C2f, [128, True]]           # 13 - C2f after P4 concatenation (B, 256, 39, 39) -> (B, 128, 39, 39)

  - [-1, 1, Conv, [256, 3, 2]]          # 14 - Downsample (stride=2) (B, 128, 39, 39) -> (B, 256, 19, 19)
  - [[-1, 4], 1, Concat, [1]]          # 15 - Concatenate with P5 (B, 256+128, 19, 19) -> (B, 384, 19, 19)
  - [-1, 3, C2f, [256, True]]           # 16 - C2f after P5 concatenation (B, 384, 19, 19) -> (B, 256, 19, 19)

  # --- Detection Head ---
  - [[10, 13, 16], 1, Detect, [nc]]   # 17 - Detect(P3, P4, P5)
