nc: 2
scales:
  s: [0.5, 0.25, 1024] 
  
backbone:
  - [-1, 1, nn.Identity, []] #0  
  # Swin track
  - [-1, 1, TorchVision, [1024, "densenet121", "DEFAULT", True, 2, True]] #1
  # Extract feature maps at different scales (adjust indices based on DenseNet121's structure)
  - [0, 1, Index, [512, 7]]  # 2 extracts 7th output (1, 512, 80, 80) - 1
  - [0, 1, Index, [1024, 9]] # 3 extracts 9th output (1, 1024, 40, 40) - 2
  - [0, 1, Index, [1024, 11]] #4 extracts 11th output (1, 1024, 20, 20) - 3
  - [-1, 1, SPPF, [1024, 5]]  #5 - P5/32 (B, 1024, 20, 20)

    # CNN
  - [0, 1, Conv, [64, 3, 2]] # 6 (1, 64, 320, 320) - (16)
  - [-1, 1, Conv, [128, 3, 2]] # 7 (1, 128, 160, 160) - (32)
  - [-1, 2, DWC3k2, [256, False, 0.25]] # 8 (1, 256, 80, 80) - (64)
  - [-1, 1, Conv, [256, 3, 2]] # 9 (1, 256, 80, 80) - (64) - multiscale 1
  - [-1, 2, DWC3k2, [512, False, 0.25]] #10 (1, 512, 40, 40) - (128)
  - [-1, 1, Conv, [512, 3, 2]] # 11 (1, 512, 40, 40) - (128)
  - [-1, 2, DWC3k2, [512, True]] #12 (1, 512, 40, 40) - (128) - multiscale 2
  - [-1, 1, Conv, [1024, 3, 2]] # 13 (1, 1024, 20, 20) - (256)
  - [-1, 2, DWC3k2, [1024, True]] #14 (1, 1024, 20, 20) - (256)
  - [-1, 1, SPPF, [1024, 5]] #15 multisclae 3
    
  #Concat
  - [[2, 9], 1, Concat, [1]] # 16 (1, 448, 80, 80)  (256)
  - [-1, 1, ECA, []]  #17
  
  - [[3, 12], 1, Concat, [1]] # 18 (1, 896, 40, 40) (512)
  - [-1, 1, ECA, []] #19

  - [[4, 15], 1, Concat, [1]] #20 (1, 1792, 20, 20) (1024)
  - [-1, 1, ECA, []]  #21

head:
#BiFPN BLOCK 1
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #22 40x40
  - [[-1, 19], 1, Concat, [1]] # 23 1024+512 = 1536
  - [-1, 3, DWC3k2, [512]] # 24 128 40x40

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #25
  - [[-1, 17], 1, Concat, [1]] # 26
  - [-1, 3, DWC3k2, [256]] # 27 80x80

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #28
  - [[-1, 24, 19], 1, Concat, [1]] # 29
  - [-1, 3, DWC3k2, [512, True]] # 30 40x40

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #31
  - [[-1, 21], 1, Concat, [1]] # 32
  - [-1, 3, DWC3k2, [1024, True]] # 33 20x20

#BiFPN Block 2
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #34
  - [[-1, 30], 1, Concat, [1]] # 35
  - [-1, 3, DWC3k2, [512]] # 36 40x40

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #37
  - [[-1, 27], 1, Concat, [1]] # 38
  - [-1, 3, DWC3k2, [256]] # 39  80x80

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #40
  - [[-1, 36, 30], 1, Concat, [1]] # 41
  - [-1, 3, DWC3k2, [512, True]] # 42 40x40

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #43
  - [[-1, 33], 1, Concat, [1]] # 44
  - [-1, 3, DWC3k2, [1024, True]] # 45 20x20

#BiFPN BLock 3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #46
  - [[-1, 42], 1, Concat, [1]] # 47
  - [-1, 3, DWC3k2, [512]] # 48 40x40

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #49
  - [[-1, 39], 1, Concat, [1]] # 50
  - [-1, 3, DWC3k2, [256]] # 51 80x80

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #52
  - [[-1, 48, 42], 1, Concat, [1]] # 53
  - [-1, 3, DWC3k2, [512, True]] # 54 40x40

  - [-1, 1, nn.Upsample, [None, 0.5, "nearest"]] #55
  - [[-1, 45], 1, Concat, [1]] # 56
  - [-1, 3, DWC3k2, [1024, True]] # 57 20x20

  - [[51, 54, 57], 1, Detect, [nc]] # 58
