nc: 1
backbone:
  - [-1, 1, TorchVision, [512, "vgg11", "DEFAULT", True, 2, False]]
head:
  - [-1, 1, nn.Identity, []]
  - [0, 1, Index, [512, 8]]  # 1 extracts 7th output (1, 512, 80, 80) - 1
  - [0, 1, Index, [512, 11]] # 2 extracts 9th output (1, 512, 40, 40) - 2
  - [0, 1, Index, [512, 12]] #3 extracts 11th output (1, 512, 20, 20) - 3
  - [-1, 1, SPPF, [512, 5]]  #4 - P5/32 (B, 512, 20, 20)
  
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #5
  - [[-1, 2], 1, Concat, [1]]                 # 6 cat backbone P4
  - [-1, 2, C3k2, [512, False]]               # 7 (40,40)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #8
  - [[-1, 1], 1, Concat, [1]]                  #9 cat backbone P3
  - [-1, 2, C3k2, [512, False]]                #10 (P3/8-small)

  - [-1, 1, Conv, [512, 3, 2]]                 #11
  - [[-1, 7], 1, Concat, [1]]                 #12 cat head P4
  - [-1, 2, C3k2, [512, False]]                #13 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                 #14
  - [[-1, 4], 1, Concat, [1]]                 #15 cat head P5
  - [-1, 2, C3k2, [512, True]]                # 16 (P5/32-large)

  - [[10, 13, 16], 1, Detect, [nc]] # 17 Detect(P3, P4, P5)
