nc: 2

scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  # s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  # m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  # l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  # x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

backbone:
  - [-1, 1, ViTBackbone, []]  # 0 - ViT as backbone
  - [0, 1, Index, [768, 0]]  # 1 - P3/8  (B, 80, 80, 768) -> Layer 4
  - [0, 1, Index, [768, 1]]  # 2 - P4/16 (B, 40, 40, 768) -> Layer 8
  - [0, 1, Index, [768, 2]]  # 3 - P5/32 (B, 20, 20, 768) -> Layer 12
  - [-1, 1, SPPF, [768, 5]]  # 4 - P5/32 with Spatial Pyramid Pooling (20,20)
  
head:
  # Use the feature maps directly
  [[-1, 1, Conv, [256, 1, 1]],  # Process feature map 0 (smallest)
   [-1, 2, C3, [256, False]],  # P3 feature refinement
   
   [0, 1, Conv, [512, 1, 1]],  # Process feature map 1 (medium)
   [-1, 2, C3, [512, False]],  # P4 feature refinement
   
   [0, 1, Conv, [1024, 1, 1]],  # Process feature map 2 (largest)
   [-1, 2, C3, [1024, False]],  # P5 feature refinement
   
   # Detection
   [[1, 3, 5], 1, Detect, [nc]]]  # Detect using all feature maps
