nc: 2

scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  # s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  # m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  # l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  # x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

backbone:
  - [-1, 1, ViTBackbone, []]  # 0 - ViT as backbone
  - [0, 1, Index, [768, 0]]  # 1 - P3/8  (B, 80, 80, 768) -> Layer 4
  - [0, 1, Index, [768, 1]]  # 2 - P4/16 (B, 40, 40, 768) -> Layer 8
  - [0, 1, Index, [768, 2]]  # 3 - P5/32 (B, 20, 20, 768) -> Layer 12
  - [-1, 1, SPPF, [768, 5]]  # 4 - P5/32 with Spatial Pyramid Pooling (20,20)
  
head:
  # --- FPN (Feature Pyramid Network) ---
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 10 - Upsample P5 to (40, 40)
  - [[-1, 2], 1, Concat, [1]]                  # 11 - Concatenate with P4 from backbone
  - [-1, 2, C3k2, [768, False]]                # 12 - Refine P4 (40, 40)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13 - Upsample P4 to (80, 80)
  - [[-1, 1], 1, Concat, [1]]                  # 14 - Concatenate with P3 from backbone
  - [-1, 2, C3k2, [768, False]]                # 15 - Refine P3 (80, 80) (P3/8-small)

  # --- PANet (Bottom-Up Pathway) ---
  - [-1, 1, Conv, [768, 3, 2]]                 # 16 - Downsample P3 (80, 80) -> (40, 40)
  - [[-1, 12], 1, Concat, [1]]                 # 17 - Concatenate with refined P4
  - [-1, 2, C3k2, [768, False]]                # 18 - Refine P4 (40, 40) (P4/16-medium)

  - [-1, 1, Conv, [768, 3, 2]]                 # 19 - Downsample P4 (40, 40) -> (20, 20)
  - [[-1, 9], 1, Concat, [1]]                  # 20 - Concatenate with refined P5
  - [-1, 2, C3k2, [768, True]]                 # 21 - Refine P5 (20, 20) (P5/32-large)

  # --- Detection Head ---
  - [[15, 18, 21], 1, Detect, [nc]]            # 22 - Detect on P3, P4, P5
