nc: 2

scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  # s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  # m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  # l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  # x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

backbone:
  - [-1, 1, TorchVision, [768, "vit_b_16", "DEFAULT", True, 2, True]]
  # Extract feature maps at different scales (adjust indices based on DenseNet121's structure)
  - [0, 1, Index, [768, 3]]       # 1 Extract feature map from 3rd Transformer Block
  - [-1, 1, Conv, [768, 1, 1]]    # 2  1×1 Conv to reshape (no change in channels)
  - [-1, 1, nn.Upsample, [80, 80]] #3 Resize to (80, 80)

  - [0, 1, Index, [768, 6]]       #4 Extract feature map from 6th Transformer Block
  - [-1, 1, Conv, [768, 1, 1]]    #5 1×1 Conv
  - [-1, 1, nn.Upsample, [40, 40]] #6 Resize to (40, 40)

  - [0, 1, Index, [768, 11]]      #7 Extract feature map from 11th Transformer Block
  - [-1, 1, Conv, [768, 1, 1]]    #8 1×1 Conv
  - [-1, 1, nn.Upsample, [20, 20]] #9 Resize to (20, 20)  
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #10 (40, 40)  
  - [[-1, 6], 1, Concat, [1]]                 # 11 cat backbone P4
  - [-1, 2, C3k2, [512, False]]               # 12 (40, 40)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #13 (80, 80)
  - [[-1, 3], 1, Concat, [1]]                  #14 cat backbone P3
  - [-1, 2, C3k2, [256, False]]                #15 (80, 80) (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                #16 (40, 40)
  - [[-1, 12], 1, Concat, [1]]                 #17 cat head P4
  - [-1, 2, C3k2, [512, False]]               #18 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                #19 (20, 20)  
  - [[-1, 9], 1, Concat, [1]]                 #20 cat head P5
  - [-1, 2, C3k2, [1024, True]]               #21 (P5/32-large)

  - [[15, 18, 21], 1, Detect, [nc]]           #22 Detect(P3, P4, P5)
